_org/_posts/2014-12-16-ubuntu-qq.org
#+STARTUP: showall indent
#+STARTUP: hidestars
#+OPTIONS: ^:{}
#+BEGIN_HTML
---
layout: view_simple
title: Ubuntu下安装qq
excerpt: 
keywords: ""
categories: [折腾Ubuntu]
tags: [ubuntu,linuxqq]
---

#+END_HTML

在Ubuntu下装QQ一直是个非常折腾人的事，试过很多方法。webqq,pidgin,longne qq,winestrick,要么不成功要么效果不好。无意间发现deepin qq（qq2012 international），安装容易，还算好用。

#+BEGIN_HTML
<!-- more -->
#+END_HTML

* Deepin-wineqq


1.安装字体ttf-wqy-microhei

如果使用的是64位系统，先安装ttf-wqy-microhei。
下载地址: http://pan.baidu.com/s/1eQIiRQE

2.执行

#+begin_src shell

wget http://packages.linuxdeepin.com/deepin/pool/non-free/d/deepinwine-qqintl/deepinwine-qqintl_0.1.3-2_all.deb
wget http://packages.linuxdeepin.com/deepin/pool/non-free/d/deepinwine-qqintl/wine-qqintl_0.1.3-2_i386.deb
sudo dpkg -i deepinwine-qqintl_0.1.3-2_all.deb wine-qqintl_0.1.3-2_i386.deb
sudo apt-get -f install
sudo dpkg -i deepinwine-qqintl_0.1.3-2_all.deb wine-qqintl_0.1.3-2_i386.deb
#+end_src

如果上面的下载地址失效，用下面这个：

#+begin_src shell

wget http://ftp.vim.org/os/Linux/distr/deepin/pool/non-free/d/deepinwine-qqintl/deepinwine-qqintl_0.1.3-2_all.deb
wget http://ftp.vim.org/os/Linux/distr/deepin/pool/non-free/d/deepinwine-qqintl/wine-qqintl_0.1.3-2_i386.deb
sudo dpkg -i deepinwine-qqintl_0.1.3-2_all.deb wine-qqintl_0.1.3-2_i386.deb
sudo apt-get -f install
sudo dpkg -i deepinwine-qqintl_0.1.3-2_all.deb wine-qqintl_0.1.3-2_i386.deb
#+end_src

* wineqq-2013tm
原文地址:http://a-nerd.info/?p=1354

这个我没试，因为上面的成功了，贴出地址:
http://www.ubuntukylin.com/applications/showimg.php?lang=cn&amp;id=23</a>
