_posts/2014-12-16-ubuntu-qq.html
---
layout: view_simple
title: Ubuntu下安装qq
excerpt: 
keywords: ""
categories: [折腾Ubuntu]
tags: [ubuntu,linuxqq]
---


<p>
在Ubuntu下装QQ一直是个非常折腾人的事，试过很多方法。webqq,pidgin,longne qq,winestrick,要么不成功要么效果不好。无意间发现deepin qq（qq2012 international），安装容易，还算好用。
</p>


<!-- more -->


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Deepin-wineqq</a></li>
<li><a href="#sec-2">2 wineqq-2013tm</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Deepin-wineqq</h2>
<div class="outline-text-2" id="text-1">



<p>
1.安装字体ttf-wqy-microhei
</p>
<p>
如果使用的是64位系统，先安装ttf-wqy-microhei。
下载地址: <a href="http://pan.baidu.com/s/1eQIiRQE">http://pan.baidu.com/s/1eQIiRQE</a>
</p>
<p>
2.执行
</p>



<pre class="example">
wget http://packages.linuxdeepin.com/deepin/pool/non-free/d/deepinwine-qqintl/deepinwine-qqintl_0.1.3-2_all.deb
wget http://packages.linuxdeepin.com/deepin/pool/non-free/d/deepinwine-qqintl/wine-qqintl_0.1.3-2_i386.deb
sudo dpkg -i deepinwine-qqintl_0.1.3-2_all.deb wine-qqintl_0.1.3-2_i386.deb
sudo apt-get -f install
sudo dpkg -i deepinwine-qqintl_0.1.3-2_all.deb wine-qqintl_0.1.3-2_i386.deb
</pre>


<p>
如果上面的下载地址失效，用下面这个：
</p>



<pre class="example">
wget http://ftp.vim.org/os/Linux/distr/deepin/pool/non-free/d/deepinwine-qqintl/deepinwine-qqintl_0.1.3-2_all.deb
wget http://ftp.vim.org/os/Linux/distr/deepin/pool/non-free/d/deepinwine-qqintl/wine-qqintl_0.1.3-2_i386.deb
sudo dpkg -i deepinwine-qqintl_0.1.3-2_all.deb wine-qqintl_0.1.3-2_i386.deb
sudo apt-get -f install
sudo dpkg -i deepinwine-qqintl_0.1.3-2_all.deb wine-qqintl_0.1.3-2_i386.deb
</pre>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">wineqq-2013tm</h2>
<div class="outline-text-2" id="text-2">

<p>原文地址:<a href="http://a-nerd.info/?p=1354">http://a-nerd.info/?p=1354</a>
</p>
<p>
这个我没试，因为上面的成功了，贴出地址:
<a href="http://www.ubuntukylin.com/applications/showimg.php?lang=cn&amp;amp;id=23">http://www.ubuntukylin.com/applications/showimg.php?lang=cn&amp;amp;id=23</a>&lt;/a&gt;
</p></div>
</div>
